; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v5)
             (pred_4 ?v12 ?v4)
             (pred_7 ?v8 ?v4)
             (pred_5 ?v7 ?v8 )
	     (pred_2 ?v8)
             (pred_1 ?v3)
             (pred_3 ?v12)
             (pred_10 ?v4)
             (pred_12 ?v8)
             (pred_8 ?v12)
             (pred_11 ?v8)
             (pred_9 ))



(:action op_3
:parameters (?v13 ?v10 ?v6 ?v11)
:precondition (and (pred_1 ?v13) (pred_1 ?v10) (pred_3 ?v6) (pred_10 ?v11)
          (pred_6 ?v13 ?v10) (pred_4 ?v6 ?v11)
                   (pred_7 ?v10 ?v11) (pred_2 ?v13) 
                   (pred_12 ?v10) (pred_8 ?v6))
:effect (and  (pred_11 ?v10) (not (pred_12 ?v10))))


(:action op_5
:parameters (?v13 ?v9)
:precondition (and (pred_1 ?v13) (pred_1 ?v9)
               (pred_2 ?v13) (pred_6 ?v13 ?v9) (pred_11 ?v9))
:effect (and (pred_2 ?v9) (not (pred_2 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_1 ?v13) (pred_3 ?v6) 
                  (pred_2 ?v13) (pred_5 ?v6 ?v13) (pred_9 ))
:effect (and (pred_8 ?v6)
   (not (pred_5 ?v6 ?v13)) (not (pred_9 ))))


(:action op_4
:parameters (?v13 ?v1 ?v2)
:precondition (and (pred_1 ?v13) (pred_3 ?v1) (pred_3 ?v2)
                  (pred_2 ?v13) (pred_8 ?v2) (pred_5 ?v1 ?v13))
:effect (and (pred_8 ?v1) (pred_5 ?v2 ?v13)
        (not (pred_8 ?v2)) (not (pred_5 ?v1 ?v13))))

(:action op_2
:parameters (?v13 ?v6)
:precondition (and (pred_1 ?v13) (pred_3 ?v6) 
                  (pred_2 ?v13) (pred_8 ?v6))
:effect (and (pred_9 ) (pred_5 ?v6 ?v13) (not (pred_8 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_20 obj_02 obj_01 obj_10 obj_11 obj_13 obj_12 obj_19 obj_07 obj_18 obj_09 obj_21 obj_15 obj_16 obj_17
    obj_14 obj_08
    obj_04 obj_03 obj_06
    )

    (:init
       (pred_9)

       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_10)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_15)
       (pred_1 obj_16)
       (pred_1 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_06)

       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_12 obj_09)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_12)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_7  obj_01 obj_14)
       (pred_7  obj_13 obj_08)
       (pred_7  obj_07 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_20)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_19)
       (pred_11 obj_18)
       (pred_11 obj_09)
       (pred_11 obj_21)
       (pred_11 obj_15)
       (pred_11 obj_16)
       (pred_11 obj_17)

       (pred_4  obj_04 obj_14)
       (pred_4  obj_03 obj_08)
       (pred_4  obj_06 obj_08)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_06 obj_10)
       (pred_2 obj_05)
    )

    (:goal (and
       (pred_5 obj_03 obj_21)
       (pred_5 obj_06 obj_19)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_5 obj_05 obj_10)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_10)
   goals met: 0 of 2
2. (op_1 obj_10 obj_06)
   deleted: (pred_5 obj_06 obj_10) (pred_9)
   added: (pred_8 obj_06)
   goals met: 0 of 2
3. (op_5 obj_10 obj_19)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_19)
   goals met: 0 of 2
4. (op_3 obj_19 obj_07 obj_06 obj_08)
   deleted: (pred_12 obj_07)
   added: (pred_11 obj_07)
   goals met: 0 of 2
5. (op_2 obj_19 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_9) (pred_5 obj_06 obj_19)
   goals met: 1 of 2
6. (op_5 obj_19 obj_21)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_21)
   goals met: 1 of 2
7. (op_5 obj_21 obj_15)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_15)
   goals met: 1 of 2
8. (op_5 obj_15 obj_16)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_16)
   goals met: 1 of 2
9. (op_5 obj_16 obj_18)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_18)
   goals met: 1 of 2
10. (op_5 obj_18 obj_09)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_09)
   goals met: 1 of 2
11. (op_1 obj_09 obj_03)
   deleted: (pred_5 obj_03 obj_09) (pred_9)
   added: (pred_8 obj_03)
   goals met: 1 of 2
12. (op_5 obj_09 obj_18)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_16)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_16)
   goals met: 1 of 2
14. (op_5 obj_16 obj_15)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_15)
   goals met: 1 of 2
15. (op_5 obj_15 obj_21)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_21)
   goals met: 1 of 2
16. (op_2 obj_21 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_9) (pred_5 obj_03 obj_21)
   goals met: 2 of 2
